Thank you @gravesm!

That resolves the problem, not sure how one would go about diagnosing the issue from the output above any pointers there would be great in case I run into something else.


```tf
$ tf apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ansible_playbook.thisisatest will be created
  + resource "ansible_playbook" "thisisatest" {
      + ansible_playbook_binary = "ansible-playbook"
      + ansible_playbook_stderr = (known after apply)
      + ansible_playbook_stdout = (known after apply)
      + args                    = (known after apply)
      + check_mode              = false
      + diff_mode               = false
      + extra_vars              = {
          + "ansible_connection" = "local"
          + "test_var"           = "thisisatest"
        }
      + force_handlers          = false
      + id                      = (known after apply)
      + ignore_playbook_failure = false
      + name                    = "localhost"
      + playbook                = "debug.playbook"
      + replayable              = true
      + temp_inventory_file     = (known after apply)
      + verbosity               = 10
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ansible_playbook.thisisatest: Creating...
ansible_playbook.thisisatest: Still creating... [10s elapsed]
ansible_playbook.thisisatest: Creation complete after 14s [id=2023-05-17 09:53:59.510784 +0100 BST m=+0.066504168]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```